###############################################################################
# Created by write_sdc
# Sun Jun  8 09:21:33 2025
###############################################################################
current_design semi_cpu_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {control}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Result[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_op_tb[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_op_tb[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_op_tb[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {an[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {an[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {an[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {an[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_tb[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_tb[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out_tb[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out_tb[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out_tb[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd1_tb[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd2_tb[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seg[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seg[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seg[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seg[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seg[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seg[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seg[6]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {Result[31]}]
set_load -pin_load 0.0334 [get_ports {Result[30]}]
set_load -pin_load 0.0334 [get_ports {Result[29]}]
set_load -pin_load 0.0334 [get_ports {Result[28]}]
set_load -pin_load 0.0334 [get_ports {Result[27]}]
set_load -pin_load 0.0334 [get_ports {Result[26]}]
set_load -pin_load 0.0334 [get_ports {Result[25]}]
set_load -pin_load 0.0334 [get_ports {Result[24]}]
set_load -pin_load 0.0334 [get_ports {Result[23]}]
set_load -pin_load 0.0334 [get_ports {Result[22]}]
set_load -pin_load 0.0334 [get_ports {Result[21]}]
set_load -pin_load 0.0334 [get_ports {Result[20]}]
set_load -pin_load 0.0334 [get_ports {Result[19]}]
set_load -pin_load 0.0334 [get_ports {Result[18]}]
set_load -pin_load 0.0334 [get_ports {Result[17]}]
set_load -pin_load 0.0334 [get_ports {Result[16]}]
set_load -pin_load 0.0334 [get_ports {Result[15]}]
set_load -pin_load 0.0334 [get_ports {Result[14]}]
set_load -pin_load 0.0334 [get_ports {Result[13]}]
set_load -pin_load 0.0334 [get_ports {Result[12]}]
set_load -pin_load 0.0334 [get_ports {Result[11]}]
set_load -pin_load 0.0334 [get_ports {Result[10]}]
set_load -pin_load 0.0334 [get_ports {Result[9]}]
set_load -pin_load 0.0334 [get_ports {Result[8]}]
set_load -pin_load 0.0334 [get_ports {Result[7]}]
set_load -pin_load 0.0334 [get_ports {Result[6]}]
set_load -pin_load 0.0334 [get_ports {Result[5]}]
set_load -pin_load 0.0334 [get_ports {Result[4]}]
set_load -pin_load 0.0334 [get_ports {Result[3]}]
set_load -pin_load 0.0334 [get_ports {Result[2]}]
set_load -pin_load 0.0334 [get_ports {Result[1]}]
set_load -pin_load 0.0334 [get_ports {Result[0]}]
set_load -pin_load 0.0334 [get_ports {alu_op_tb[2]}]
set_load -pin_load 0.0334 [get_ports {alu_op_tb[1]}]
set_load -pin_load 0.0334 [get_ports {alu_op_tb[0]}]
set_load -pin_load 0.0334 [get_ports {an[3]}]
set_load -pin_load 0.0334 [get_ports {an[2]}]
set_load -pin_load 0.0334 [get_ports {an[1]}]
set_load -pin_load 0.0334 [get_ports {an[0]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[31]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[30]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[29]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[28]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[27]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[26]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[25]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[24]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[23]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[22]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[21]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[20]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[19]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[18]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[17]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[16]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[15]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[14]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[13]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[12]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[11]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[10]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[9]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[8]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[7]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[6]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[5]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[4]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[3]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[2]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[1]}]
set_load -pin_load 0.0334 [get_ports {immediate_tb[0]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[31]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[30]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[29]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[28]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[27]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[26]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[25]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[24]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[23]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[22]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[21]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[20]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[19]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[18]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[17]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[16]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[15]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[14]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[13]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[12]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[11]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[10]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[9]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[8]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[7]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[6]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[5]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[4]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[3]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[2]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[1]}]
set_load -pin_load 0.0334 [get_ports {instruction_tb[0]}]
set_load -pin_load 0.0334 [get_ports {pc_out_tb[2]}]
set_load -pin_load 0.0334 [get_ports {pc_out_tb[1]}]
set_load -pin_load 0.0334 [get_ports {pc_out_tb[0]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[31]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[30]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[29]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[28]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[27]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[26]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[25]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[24]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[23]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[22]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[21]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[20]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[19]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[18]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[17]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[16]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[15]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[14]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[13]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[12]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[11]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[10]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[9]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[8]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[7]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[6]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[5]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[4]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[3]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[2]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[1]}]
set_load -pin_load 0.0334 [get_ports {rd1_tb[0]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[31]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[30]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[29]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[28]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[27]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[26]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[25]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[24]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[23]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[22]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[21]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[20]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[19]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[18]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[17]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[16]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[15]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[14]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[13]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[12]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[11]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[10]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[9]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[8]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[7]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[6]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[5]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[4]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[3]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[2]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[1]}]
set_load -pin_load 0.0334 [get_ports {rd2_tb[0]}]
set_load -pin_load 0.0334 [get_ports {seg[6]}]
set_load -pin_load 0.0334 [get_ports {seg[5]}]
set_load -pin_load 0.0334 [get_ports {seg[4]}]
set_load -pin_load 0.0334 [get_ports {seg[3]}]
set_load -pin_load 0.0334 [get_ports {seg[2]}]
set_load -pin_load 0.0334 [get_ports {seg[1]}]
set_load -pin_load 0.0334 [get_ports {seg[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {control}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
