
===========================================================================
report_tns
============================================================================
tns -239.83

===========================================================================
report_wns
============================================================================
wns -4.52

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -4.52

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.12
