
===========================================================================
report_tns
============================================================================
tns -261.05

===========================================================================
report_wns
============================================================================
wns -4.78

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -4.78

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.12
