
===========================================================================
report_tns
============================================================================
tns -23.56

===========================================================================
report_wns
============================================================================
wns -0.64

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -0.64

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.15
