###############################################################################
# Created by write_sdc
# Sun Jun  1 13:56:26 2025
###############################################################################
current_design TopModule
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A1[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A1[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A1[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A1[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A1[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A2[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A2[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A2[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A2[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A2[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A3[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A3[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A3[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A3[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A3[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WE3}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputA[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputB[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {opcode[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {opcode[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD1[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RD2[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputC[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {RD1[31]}]
set_load -pin_load 0.0334 [get_ports {RD1[30]}]
set_load -pin_load 0.0334 [get_ports {RD1[29]}]
set_load -pin_load 0.0334 [get_ports {RD1[28]}]
set_load -pin_load 0.0334 [get_ports {RD1[27]}]
set_load -pin_load 0.0334 [get_ports {RD1[26]}]
set_load -pin_load 0.0334 [get_ports {RD1[25]}]
set_load -pin_load 0.0334 [get_ports {RD1[24]}]
set_load -pin_load 0.0334 [get_ports {RD1[23]}]
set_load -pin_load 0.0334 [get_ports {RD1[22]}]
set_load -pin_load 0.0334 [get_ports {RD1[21]}]
set_load -pin_load 0.0334 [get_ports {RD1[20]}]
set_load -pin_load 0.0334 [get_ports {RD1[19]}]
set_load -pin_load 0.0334 [get_ports {RD1[18]}]
set_load -pin_load 0.0334 [get_ports {RD1[17]}]
set_load -pin_load 0.0334 [get_ports {RD1[16]}]
set_load -pin_load 0.0334 [get_ports {RD1[15]}]
set_load -pin_load 0.0334 [get_ports {RD1[14]}]
set_load -pin_load 0.0334 [get_ports {RD1[13]}]
set_load -pin_load 0.0334 [get_ports {RD1[12]}]
set_load -pin_load 0.0334 [get_ports {RD1[11]}]
set_load -pin_load 0.0334 [get_ports {RD1[10]}]
set_load -pin_load 0.0334 [get_ports {RD1[9]}]
set_load -pin_load 0.0334 [get_ports {RD1[8]}]
set_load -pin_load 0.0334 [get_ports {RD1[7]}]
set_load -pin_load 0.0334 [get_ports {RD1[6]}]
set_load -pin_load 0.0334 [get_ports {RD1[5]}]
set_load -pin_load 0.0334 [get_ports {RD1[4]}]
set_load -pin_load 0.0334 [get_ports {RD1[3]}]
set_load -pin_load 0.0334 [get_ports {RD1[2]}]
set_load -pin_load 0.0334 [get_ports {RD1[1]}]
set_load -pin_load 0.0334 [get_ports {RD1[0]}]
set_load -pin_load 0.0334 [get_ports {RD2[31]}]
set_load -pin_load 0.0334 [get_ports {RD2[30]}]
set_load -pin_load 0.0334 [get_ports {RD2[29]}]
set_load -pin_load 0.0334 [get_ports {RD2[28]}]
set_load -pin_load 0.0334 [get_ports {RD2[27]}]
set_load -pin_load 0.0334 [get_ports {RD2[26]}]
set_load -pin_load 0.0334 [get_ports {RD2[25]}]
set_load -pin_load 0.0334 [get_ports {RD2[24]}]
set_load -pin_load 0.0334 [get_ports {RD2[23]}]
set_load -pin_load 0.0334 [get_ports {RD2[22]}]
set_load -pin_load 0.0334 [get_ports {RD2[21]}]
set_load -pin_load 0.0334 [get_ports {RD2[20]}]
set_load -pin_load 0.0334 [get_ports {RD2[19]}]
set_load -pin_load 0.0334 [get_ports {RD2[18]}]
set_load -pin_load 0.0334 [get_ports {RD2[17]}]
set_load -pin_load 0.0334 [get_ports {RD2[16]}]
set_load -pin_load 0.0334 [get_ports {RD2[15]}]
set_load -pin_load 0.0334 [get_ports {RD2[14]}]
set_load -pin_load 0.0334 [get_ports {RD2[13]}]
set_load -pin_load 0.0334 [get_ports {RD2[12]}]
set_load -pin_load 0.0334 [get_ports {RD2[11]}]
set_load -pin_load 0.0334 [get_ports {RD2[10]}]
set_load -pin_load 0.0334 [get_ports {RD2[9]}]
set_load -pin_load 0.0334 [get_ports {RD2[8]}]
set_load -pin_load 0.0334 [get_ports {RD2[7]}]
set_load -pin_load 0.0334 [get_ports {RD2[6]}]
set_load -pin_load 0.0334 [get_ports {RD2[5]}]
set_load -pin_load 0.0334 [get_ports {RD2[4]}]
set_load -pin_load 0.0334 [get_ports {RD2[3]}]
set_load -pin_load 0.0334 [get_ports {RD2[2]}]
set_load -pin_load 0.0334 [get_ports {RD2[1]}]
set_load -pin_load 0.0334 [get_ports {RD2[0]}]
set_load -pin_load 0.0334 [get_ports {outputC[31]}]
set_load -pin_load 0.0334 [get_ports {outputC[30]}]
set_load -pin_load 0.0334 [get_ports {outputC[29]}]
set_load -pin_load 0.0334 [get_ports {outputC[28]}]
set_load -pin_load 0.0334 [get_ports {outputC[27]}]
set_load -pin_load 0.0334 [get_ports {outputC[26]}]
set_load -pin_load 0.0334 [get_ports {outputC[25]}]
set_load -pin_load 0.0334 [get_ports {outputC[24]}]
set_load -pin_load 0.0334 [get_ports {outputC[23]}]
set_load -pin_load 0.0334 [get_ports {outputC[22]}]
set_load -pin_load 0.0334 [get_ports {outputC[21]}]
set_load -pin_load 0.0334 [get_ports {outputC[20]}]
set_load -pin_load 0.0334 [get_ports {outputC[19]}]
set_load -pin_load 0.0334 [get_ports {outputC[18]}]
set_load -pin_load 0.0334 [get_ports {outputC[17]}]
set_load -pin_load 0.0334 [get_ports {outputC[16]}]
set_load -pin_load 0.0334 [get_ports {outputC[15]}]
set_load -pin_load 0.0334 [get_ports {outputC[14]}]
set_load -pin_load 0.0334 [get_ports {outputC[13]}]
set_load -pin_load 0.0334 [get_ports {outputC[12]}]
set_load -pin_load 0.0334 [get_ports {outputC[11]}]
set_load -pin_load 0.0334 [get_ports {outputC[10]}]
set_load -pin_load 0.0334 [get_ports {outputC[9]}]
set_load -pin_load 0.0334 [get_ports {outputC[8]}]
set_load -pin_load 0.0334 [get_ports {outputC[7]}]
set_load -pin_load 0.0334 [get_ports {outputC[6]}]
set_load -pin_load 0.0334 [get_ports {outputC[5]}]
set_load -pin_load 0.0334 [get_ports {outputC[4]}]
set_load -pin_load 0.0334 [get_ports {outputC[3]}]
set_load -pin_load 0.0334 [get_ports {outputC[2]}]
set_load -pin_load 0.0334 [get_ports {outputC[1]}]
set_load -pin_load 0.0334 [get_ports {outputC[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WE3}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A1[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A1[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A1[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A1[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A1[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A2[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A2[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A2[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A2[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A2[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A3[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A3[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A3[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A3[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A3[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {opcode[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {opcode[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
