
===========================================================================
report_tns
============================================================================
tns -217.92

===========================================================================
report_wns
============================================================================
wns -4.24

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -4.24

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.11
