
===========================================================================
report_tns
============================================================================
tns -13.72

===========================================================================
report_wns
============================================================================
wns -0.48

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -0.48

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.14
